#include <iostream>

using namespace std;

// Солих тоонуудын заалтыг функцийн параметрээр дамжуулан аваад х болон у заалтуудыг оруулж өгнө
void swap(int &x, int &y) {

    // Солих үед аль нэг хувьсагчийн утгыг түр хадгалах 3 дахь хувьсагчийг зарлаж өгнө
    int temp;
    // Энэ тохиолдолд а буюу х заалт дээрх утгыг 3 дахь хувьсагчид хадгална
    temp=x;
    // b буюу у заалт дээрх утгыг а буюу х заалт дээрх утганд хадгална
    x=y;
    // Түр хадгалсан а буюу х хувьсагчийн анхны утгыг b буюу у хувьсагчид хадгалснаар солих үйлдэл дуусгавар болно
    y=temp;
}

int main() {

    // Солих хувьсагчуудыг зарлана, утгыг оноож өгнө
    int a=10,b=5;

    // Солихоос өмнөх утгуудыг хэвлэнэ
    cout << "a= " << a << " b= " << b << endl;
    // Солих үйлдлийг хийхдээ заалтуудыг дамжуулж өгнө
    swap(a,b);
    
    // Солих үйлдлийн дараах утгуудыг хэвлэнэ
    cout << "a= " << a << " b= " << b << endl;
}