#include <iostream>

using namespace std;

// Солих тоонуудын хаягийг функцийн параметрээр дамжуулан авна
void swap(int *a, int *b) {

    // Солих үед аль нэг хувьсагчийн утгыг түр хадгалах 3 дахь хувьсагчийг зарлаж өгнө
    int temp;
    // Энэ тохиолдолд а хаяг дээрх утганд хандаж 3 дахь хувьсагчид хадгална
    temp=*a;
    // b хаяг дээрх утгыг а хаяг дээрх утганд хадгална
    *a=*b;
    // Түр хадгалсан а хувьсагчийн анхны утгыг b хувьсагчид хадгалснаар солих үйлдэл дуусгавар болно
    *b=temp;
}

int main() {

    // Солих хувьсагчуудыг зарлана, утгыг оноож өгнө
    int a=10,b=5;

    // Солихоос өмнөх утгуудыг хэвлэнэ
    cout << "a= " << a << " b= " << b << endl;
    // Солих үйлдлийг хийхдээ хаягуудыг дамжуулж өгнө
    swap(&a,&b);
    
    // Солих үйлдлийн дараах утгуудыг хэвлэнэ
    cout << "a= " << a << " b= " << b << endl;
}