#include <iostream>

using namespace std;

int main() {

    // 5 ширхэг бүхэл тоо хадгалах хүснэгт зарлана
    int numbers[5];

    // Бүхэл тоог хадгалах хувьсагчийн хаягийг хадгалах хаяган хувьсагч зарлана 
    int * p;

    // Хаяган хувьсагчид хүснэгтийн хамгийн эхний элементийн хаягийг хадгалж, тус хаягаар нь утганд нь хандаж 10 болгосон
    p = numbers;  *p = 10;

    // Хаягийн арифметик ашиглан хүснэгтийн дараагийн элементийн хаяг руу шилжиж, хүснэгтийн 2-р элементийн утгыг 20 болгосон
    p++;  *p = 20;

    // Хүснэгтийн 3-р элементийн хаягийг хаяган хувьсагчид оноож өгч, хаягаар нь утганд нь хандаж 30 болгосон
    p = &numbers[2];  *p = 30;

    // Хүснэгтийн 4-р элемент рүү хаягийн арифметик ашиглан 1-р элементээс шилжин хадгалаад, хаягаар дамжин утгыг нь 40 болгосон
    p = numbers + 3;  *p = 40;

    // Хаяган хувьсагчид хүснэгтийн эхний элементийн хаягийг хадгалж, хаягийн арифметикээр 5-р элемент рүү шилжиж, утганд нь хандаж 50 болгосон
    p = numbers;  *(p+4) = 50;

    // Давталт ашиглаж хүснэгтийн элементүүдийг хэвлэсэн
    for (int n=0; n<5; n++)
    cout << numbers[n] << ", ";

}